# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...


from room_1 import folks as folks_1
from room_2 import folks as folks_2

print('В комнате room_1 живут:', ", ".join(folks_1), '\nВ комнате room_2 живёт:', " ".join(folks_2))


# import room_1
# import room_2
#
# print('В комнате room_1 живут:', room_1.folks, '\nВ комнате room_2 живёт:', room_2.folks)

# так, я же так и сделал выше) просто закомментировал) решил сделать два варианта, так сказать)
#зачет!